# 21
a = 2
b = 3
print("%d x %d = %d" % (a, b, a*b))
print(a, "x", b, "=", a*b)

# 22
a = 2
b = 3
print('%d + %d = %d + %d = %d' % (a, b, b, a, a+b))
print(a, "+", b, "=", b, "+", a, "=", a+b)

# 23
a = 2
b = 3
c = 5
print('%d*(%d+%d) = %d*%d+%d*%d' % (a, b, c, a, b, a, c))

# 24
a = 2.5
b = 2.4
print('%.1f + %.1f = %.4f' % (a, b, a+b))


# 25
a = 5
b = 2
print('%.2f - %.2f = %.4f' % (a, b, a-b))

# 26
birthday = 25
print("ฉันเกิดวันที่", (birthday), "ธันวาคม")

# 27
a = 5
b = 100
print(a, 'เท่าของ', b, 'มัค่าเท่ากับ', a*b)
print('%d เท่าของ %d มีค่าเท่ากับ %d' % (a, b, a*b))

# 28
a = 3.5
print('เขามีเงินเย่อะกว่าฉัน %.2f บาท' % a)

# 29
a = 5
print('ฉันได้กำไร', a, '%')
print('ฉันได้กำไร %d %%' % a)

# 30
a = 2
b = 3.5
print('เมื่อวานฉันขาดทุน', a, '%', 'วันนี้ฉันได่กำไร', '%.2f' % b, '%')
print('เมื่อวานฉันขาดทุน %d %% วันนี้ฉันได้กำไร %.2f %%' % (a, b))
